In [577]:
import numpy as np
import pandas as pd
import seaborn as sns

In [30]:
np.random.seed(0)

x1 = np.random.randint(10, size=6)  # One-dimensional array
x2 = np.random.randint(10, size=(3, 4))  # Two-dimensional array
x3 = np.random.randint(10, size=(3, 4, 5))  # Three-dimensional array

In [31]:
x2

array([[3, 5, 2, 4],
       [7, 6, 8, 8],
       [1, 6, 7, 7]])

In [32]:
xsub = x2[:2,:]
xsub[1,1] = 5
x2

array([[3, 5, 2, 4],
       [7, 5, 8, 8],
       [1, 6, 7, 7]])

In [33]:

i = [2, 3, 3, 4, 4, 4]
np.random.seed(42)
x = np.random.randn(100)

# compute a histogram by hand
bins = np.linspace(-5, 5, 20)
counts = np.zeros_like(bins)

# find the appropriate bin for each x
i = np.searchsorted(bins, x)

# add 1 to each of these bins
np.add.at(counts, i, 1)

In [34]:
import pandas as pd
pd.Series(x1)

0    5
1    0
2    3
3    3
4    7
5    9
dtype: int64

In [35]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2,4])

3      c
2      a
4    NaN
dtype: object

In [36]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [37]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [38]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [39]:
data.density>100

California    False
Florida        True
Illinois      False
New York       True
Texas         False
Name: density, dtype: bool

In [40]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [41]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A.stack().mean()

11.0

In [42]:

index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

index = pd.MultiIndex.from_tuples(index)
index
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [43]:
pop[1:5]

California  2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
dtype: int64

In [44]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])

In [45]:
??pd.DataFrame

In [46]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [47]:
df.groupby('key').aggregate(['min',np.median,np.max])

    data1             data2
      min median amax   min median amax
key
A       0    1.5    3     3    4.0    5
B       1    2.5    4     0    3.5    7
C       2    3.5    5     3    6.0    9

In [48]:
def filter_func(x):
    return x['data2'].std() > 4
df.groupby('key').filter(filter_func)
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [49]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [50]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x
df.groupby('key')

In [51]:
df['key']

0    A
1    B
2    C
3    A
4    B
5    C
Name: key, dtype: object

In [52]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [261]:

index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

index = pd.MultiIndex.from_tuples(index)
index
pop = pop.reindex(index)
#pop.index.names = ['state','year']
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [260]:
ser1 = pd.Series(['A', 'B', 'C'])
ser2 = pd.Series(['D', 'E', 'F'])
pd.concat([ser1, ser2])

0    A
1    B
2    C
0    D
1    E
2    F
dtype: object

In [100]:
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 57935  100 57935    0     0   235k      0 --:--:-- --:--:-- --:--:--  235k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0   4053      0 --:--:-- --:--:-- --:--:--  4053
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0   4132      0 --:--:-- --:--:-- --:--:--  4132

In [205]:
pop2 = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

In [267]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [258]:
idx = pd.IndexSlice
pop2Series = pop2.set_index(['state/region','year']).stack()
pop2Series.head()

state/region  year
AL            2012  ages              under18
                    population    1.11749e+06
                    ages                total
                    population    4.81753e+06
              2010  ages              under18
dtype: object

In [255]:
pop2Series.index[0]

('AL', 2012, 'under18', 'population')

In [509]:
merged = pd.merge(pop2, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', 1) # drop duplicate info
merged.head()
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()
final = pd.merge(merged, areas, on='state', how='left')
final.head()
final = final.drop("state",axis=1).rename(columns={"state/region":"state"})
final.head()

  state     ages  year  population  area (sq. mi)
0    AL  under18  2012   1117489.0        52423.0
1    AL    total  2012   4817528.0        52423.0
2    AL  under18  2010   1130966.0        52423.0
3    AL    total  2010   4785570.0        52423.0
4    AL  under18  2011   1125763.0        52423.0

In [510]:
finMI= final.set_index(['state','ages','year']).sort_index().drop("USA")
finMI.head()

                  population  area (sq. mi)
state ages  year
AK    total 1990    553290.0       656425.0
            1991    570193.0       656425.0
            1992    588736.0       656425.0
            1993    599434.0       656425.0
            1994    603308.0       656425.0

In [534]:
CA = finMI.loc[("CA","total"),:].loc[2005:2008,:]
AL = finMI.loc[("AL","total"),:].loc[2005:2008,:]
CA_AL = pd.concat([CA,AL],keys=["CA","AL"])
CA_AL.index.names = ["state","year"]
CA_AL

            population  area (sq. mi)
state year
CA    2005  35827943.0       163707.0
      2006  36021202.0       163707.0
      2007  36250311.0       163707.0
      2008  36604337.0       163707.0
AL    2005   4569805.0        52423.0
      2006   4628981.0        52423.0
      2007   4672840.0        52423.0
      2008   4718206.0        52423.0

## Aggregation and grouping

In [515]:
CA_AL.groupby("year").describe()

     population                                                                \
          count        mean           std        min          25%         50%
year
2005        2.0  20198874.0  2.210284e+07  4569805.0  12384339.50  20198874.0
2006        2.0  20325091.5  2.219765e+07  4628981.0  12477036.25  20325091.5
2007        2.0  20461575.5  2.232864e+07  4672840.0  12567207.75  20461575.5
2008        2.0  20661271.5  2.254690e+07  4718206.0  12689738.75  20661271.5

                              area (sq. mi)                                   \
              75%         max         count      mean           std      min
year
2005  28013408.50  35827943.0           2.0  108065.0  78689.671038  52423.0
2006  28173146.75  36021202.0           2.0  108065.0  78689.671038  52423.0
2007  28355943.25  36250311.0           2.0  108065.0  78689.671038  52423.0
2008  28632804.25  36604337.0           2.0  108065.0  78689.671038  52423.0


          25%       50%       75%       max
year
2005  80244.0  108065.0  135886.0  163707.0
2006  80244.0  108065.0  135886.0  163707.0
2007  80244.0  108065.0  135886.0  163707.0
2008  80244.0  108065.0  135886.0  163707.0

In [516]:
finMI.groupby(["year","ages"]).sum().tail()

               population  area (sq. mi)
year ages
2011 under18   74771549.0      3790399.0
2012 total    317525230.0      3790399.0
     under18   74549919.0      3790399.0
2013 total    319743925.0      3790399.0
     under18   74399940.0      3790399.0

In [518]:
def testFunc(x):
    x["density"]=x["population"]/x["area (sq. mi)"].sum()
    return x
#Kind of a pretty stupid example. But now I get point of apply slightly more
finMI.groupby(["year","ages"]).apply(testFunc).groupby(["year","ages"]).sum().tail()

               population  area (sq. mi)    density
year ages
2011 under18   74771549.0      3790399.0  19.726564
2012 total    317525230.0      3790399.0  83.770925
     under18   74549919.0      3790399.0  19.668093
2013 total    319743925.0      3790399.0  84.356271
     under18   74399940.0      3790399.0  19.628525

In [576]:
short = CA_AL.loc[idx[:,2005:2006],:]
mapping = {("CA",2005):"NewCA","AL":"AL"}
short.groupby([lambda x: x[0].join(str(x[1])),mapping]).sum()

                  population  area (sq. mi)
2CA0CA0CA5 NewCA  35827943.0       163707.0

In [555]:
tup = ("5","2")

In [561]:
"".join(tup)

'52'

## Pivot Tables

In [579]:
# !curl -O https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  258k  100  258k    0     0   882k      0 --:--:-- --:--:-- --:--:--  882k

In [581]:
births = pd.read_csv('births.csv')

## String manipulation